{
    "class_name": "Model", 
    "keras_version": "2.0.5", 
    "config": {
        "layers": [
            {
                "class_name": "InputLayer", 
                "inbound_nodes": [], 
                "config": {
                    "dtype": "float32", 
                    "batch_input_shape": [
                        null, 
                        224, 
                        224, 
                        3
                    ], 
                    "name": "input_1", 
                    "sparse": false
                }, 
                "name": "input_1"
            }, 
            {
                "class_name": "ZeroPadding2D", 
                "inbound_nodes": [
                    [
                        [
                            "input_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "padding": [
                        [
                            3, 
                            3
                        ], 
                        [
                            3, 
                            3
                        ]
                    ], 
                    "trainable": true, 
                    "name": "zero_padding2d_1", 
                    "data_format": "channels_last"
                }, 
                "name": "zero_padding2d_1"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "conv1", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        2, 
                        2
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        7, 
                        7
                    ]
                }, 
                "name": "conv1"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "conv1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "bn_conv1", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": true, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "bn_conv1"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "bn_conv1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_1"
                }, 
                "name": "activation_1"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "name": "max_pooling2d_1", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "pool_size": [
                        3, 
                        3
                    ], 
                    "padding": "valid", 
                    "strides": [
                        2, 
                        2
                    ]
                }, 
                "name": "max_pooling2d_1"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "res2a_branch2a", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "name": "res2a_branch2a"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2a", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "bn2a_branch2a", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": true, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "bn2a_branch2a"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "bn2a_branch2a", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_2"
                }, 
                "name": "activation_2"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "res2a_branch2b", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        3, 
                        3
                    ]
                }, 
                "name": "res2a_branch2b"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2b", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "bn2a_branch2b", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": true, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "bn2a_branch2b"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "bn2a_branch2b", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_3"
                }, 
                "name": "activation_3"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_3", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "res2a_branch2c", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 256, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "name": "res2a_branch2c"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "res2a_branch1", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 256, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "name": "res2a_branch1"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2c", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "bn2a_branch2c", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": true, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "bn2a_branch2c"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "bn2a_branch1", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": true, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "bn2a_branch1"
            }, 
            {
                "class_name": "Add", 
                "inbound_nodes": [
                    [
                        [
                            "bn2a_branch2c", 
                            0, 
                            0, 
                            {}
                        ], 
                        [
                            "bn2a_branch1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "trainable": true, 
                    "name": "add_1"
                }, 
                "name": "add_1"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "add_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_4"
                }, 
                "name": "activation_4"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_4", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "res2b_branch2a", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "name": "res2b_branch2a"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "res2b_branch2a", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "bn2b_branch2a", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": true, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "bn2b_branch2a"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "bn2b_branch2a", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_5"
                }, 
                "name": "activation_5"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_5", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "res2b_branch2b", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        3, 
                        3
                    ]
                }, 
                "name": "res2b_branch2b"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "res2b_branch2b", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "bn2b_branch2b", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": true, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "bn2b_branch2b"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "bn2b_branch2b", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_6"
                }, 
                "name": "activation_6"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_6", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "res2b_branch2c", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 256, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "name": "res2b_branch2c"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "res2b_branch2c", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "bn2b_branch2c", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": true, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "bn2b_branch2c"
            }, 
            {
                "class_name": "Add", 
                "inbound_nodes": [
                    [
                        [
                            "bn2b_branch2c", 
                            0, 
                            0, 
                            {}
                        ], 
                        [
                            "activation_4", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "trainable": true, 
                    "name": "add_2"
                }, 
                "name": "add_2"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "add_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_7"
                }, 
                "name": "activation_7"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_7", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "res2c_branch2a", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "name": "res2c_branch2a"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "res2c_branch2a", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "bn2c_branch2a", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": true, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "bn2c_branch2a"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "bn2c_branch2a", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_8"
                }, 
                "name": "activation_8"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_8", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "res2c_branch2b", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        3, 
                        3
                    ]
                }, 
                "name": "res2c_branch2b"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "res2c_branch2b", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "bn2c_branch2b", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": true, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "bn2c_branch2b"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "bn2c_branch2b", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_9"
                }, 
                "name": "activation_9"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_9", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "res2c_branch2c", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 256, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "name": "res2c_branch2c"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "res2c_branch2c", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "bn2c_branch2c", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": true, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "bn2c_branch2c"
            }, 
            {
                "class_name": "Add", 
                "inbound_nodes": [
                    [
                        [
                            "bn2c_branch2c", 
                            0, 
                            0, 
                            {}
                        ], 
                        [
                            "activation_7", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "trainable": true, 
                    "name": "add_3"
                }, 
                "name": "add_3"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "add_3", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_10"
                }, 
                "name": "activation_10"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_10", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "res3a_branch2a", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        2, 
                        2
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "name": "res3a_branch2a"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "res3a_branch2a", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
