{
    "class_name": "Model", 
    "keras_version": "2.0.5", 
    "config": {
        "layers": [
            {
                "class_name": "InputLayer", 
                "inbound_nodes": [], 
                "config": {
                    "dtype": "float32", 
                    "batch_input_shape": [
                        null, 
                        299, 
                        299, 
                        3
                    ], 
                    "name": "input_1", 
                    "sparse": false
                }, 
                "name": "input_1"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "input_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "conv2d_1", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        2, 
                        2
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 32, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": false, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        3, 
                        3
                    ]
                }, 
                "name": "conv2d_1"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "batch_normalization_1", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": false, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "batch_normalization_1"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_1"
                }, 
                "name": "activation_1"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "conv2d_2", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 32, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": false, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        3, 
                        3
                    ]
                }, 
                "name": "conv2d_2"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "batch_normalization_2", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": false, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "batch_normalization_2"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_2"
                }, 
                "name": "activation_2"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "conv2d_3", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": false, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        3, 
                        3
                    ]
                }, 
                "name": "conv2d_3"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_3", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "batch_normalization_3", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": false, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "batch_normalization_3"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_3", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_3"
                }, 
                "name": "activation_3"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_3", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "name": "max_pooling2d_1", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "pool_size": [
                        3, 
                        3
                    ], 
                    "padding": "valid", 
                    "strides": [
                        2, 
                        2
                    ]
                }, 
                "name": "max_pooling2d_1"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "conv2d_4", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 80, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": false, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "name": "conv2d_4"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_4", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "batch_normalization_4", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": false, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "batch_normalization_4"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_4", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_4"
                }, 
                "name": "activation_4"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_4", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "conv2d_5", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 192, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": false, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        3, 
                        3
                    ]
                }, 
                "name": "conv2d_5"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_5", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "batch_normalization_5", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": false, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "batch_normalization_5"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_5", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_5"
                }, 
                "name": "activation_5"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_5", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "name": "max_pooling2d_2", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "pool_size": [
                        3, 
                        3
                    ], 
                    "padding": "valid", 
                    "strides": [
                        2, 
                        2
                    ]
                }, 
                "name": "max_pooling2d_2"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "conv2d_9", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": false, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "name": "conv2d_9"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_9", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "batch_normalization_9", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": false, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "batch_normalization_9"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_9", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_9"
                }, 
                "name": "activation_9"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "conv2d_7", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 48, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": false, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "name": "conv2d_7"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_9", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "conv2d_10", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 96, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": false, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        3, 
                        3
                    ]
                }, 
                "name": "conv2d_10"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_7", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "batch_normalization_7", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": false, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "batch_normalization_7"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_10", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "batch_normalization_10", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": false, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "batch_normalization_10"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_7", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_7"
                }, 
                "name": "activation_7"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_10", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_10"
                }, 
                "name": "activation_10"
            }, 
            {
                "class_name": "AveragePooling2D", 
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "name": "average_pooling2d_1", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "pool_size": [
                        3, 
                        3
                    ], 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ]
                }, 
                "name": "average_pooling2d_1"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "conv2d_6", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": false, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "name": "conv2d_6"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_7", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "conv2d_8", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": false, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        5, 
                        5
                    ]
                }, 
                "name": "conv2d_8"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_10", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "conv2d_11", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 96, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": false, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        3, 
                        3
                    ]
                }, 
                "name": "conv2d_11"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "conv2d_12", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 32, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": false, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "name": "conv2d_12"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_6", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "batch_normalization_6", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": false, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "batch_normalization_6"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_8", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "batch_normalization_8", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": false, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "batch_normalization_8"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_11", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "batch_normalization_11", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": false, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "batch_normalization_11"
            }, 
            {
                "class_name": "BatchNormalization", 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_12", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "gamma_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "moving_mean_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "name": "batch_normalization_12", 
                    "epsilon": 0.001, 
                    "trainable": true, 
                    "center": true, 
                    "moving_variance_initializer": {
                        "class_name": "Ones", 
                        "config": {}
                    }, 
                    "beta_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "scale": false, 
                    "gamma_regularizer": null, 
                    "gamma_constraint": null, 
                    "beta_constraint": null, 
                    "beta_regularizer": null, 
                    "momentum": 0.99, 
                    "axis": 3
                }, 
                "name": "batch_normalization_12"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_6", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_6"
                }, 
                "name": "activation_6"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_8", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_8"
                }, 
                "name": "activation_8"
            }, 
            {
                "class_name": "Activation", 
