{
   "class_name": "Model",
   "keras_version": "2.1.4",
   "config": {
      "layers": [
         {
            "class_name": "InputLayer",
            "config": {
               "dtype": "float32",
               "batch_input_shape": [
                  null,
                  299,
                  299,
                  3
               ],
               "name": "input_12",
               "sparse": false
            },
            "inbound_nodes": [],
            "name": "input_12"
         },
         {
            "class_name": "Conv2D",
            "config": {
               "kernel_constraint": null,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "normal",
                     "scale": 2,
                     "seed": null,
                     "mode": "fan_in"
                  }
               },
               "name": "conv2d_452",
               "bias_regularizer": null,
               "bias_constraint": null,
               "activation": "linear",
               "trainable": true,
               "data_format": "channels_last",
               "padding": "valid",
               "strides": [
                  2,
                  2
               ],
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l2": 4.0E-5,
                     "l1": 0
                  }
               },
               "filters": 32,
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "use_bias": false,
               "activity_regularizer": null,
               "kernel_size": [
                  3,
                  3
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "input_12",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "conv2d_452"
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "beta_constraint": null,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_452",
               "epsilon": 0.001,
               "trainable": true,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "scale": false,
               "axis": -1,
               "gamma_constraint": null,
               "gamma_regularizer": null,
               "beta_regularizer": null,
               "momentum": 0.9997,
               "center": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_452",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "batch_normalization_452"
         },
         {
            "class_name": "Activation",
            "config": {
               "activation": "relu",
               "trainable": true,
               "name": "activation_452"
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_452",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "activation_452"
         },
         {
            "class_name": "Conv2D",
            "config": {
               "kernel_constraint": null,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "normal",
                     "scale": 2,
                     "seed": null,
                     "mode": "fan_in"
                  }
               },
               "name": "conv2d_453",
               "bias_regularizer": null,
               "bias_constraint": null,
               "activation": "linear",
               "trainable": true,
               "data_format": "channels_last",
               "padding": "valid",
               "strides": [
                  1,
                  1
               ],
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l2": 4.0E-5,
                     "l1": 0
                  }
               },
               "filters": 32,
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "use_bias": false,
               "activity_regularizer": null,
               "kernel_size": [
                  3,
                  3
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "activation_452",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "conv2d_453"
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "beta_constraint": null,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_453",
               "epsilon": 0.001,
               "trainable": true,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "scale": false,
               "axis": -1,
               "gamma_constraint": null,
               "gamma_regularizer": null,
               "beta_regularizer": null,
               "momentum": 0.9997,
               "center": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_453",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "batch_normalization_453"
         },
         {
            "class_name": "Activation",
            "config": {
               "activation": "relu",
               "trainable": true,
               "name": "activation_453"
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_453",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "activation_453"
         },
         {
            "class_name": "Conv2D",
            "config": {
               "kernel_constraint": null,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "normal",
                     "scale": 2,
                     "seed": null,
                     "mode": "fan_in"
                  }
               },
               "name": "conv2d_454",
               "bias_regularizer": null,
               "bias_constraint": null,
               "activation": "linear",
               "trainable": true,
               "data_format": "channels_last",
               "padding": "same",
               "strides": [
                  1,
                  1
               ],
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l2": 4.0E-5,
                     "l1": 0
                  }
               },
               "filters": 64,
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "use_bias": false,
               "activity_regularizer": null,
               "kernel_size": [
                  3,
                  3
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "activation_453",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "conv2d_454"
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "beta_constraint": null,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_454",
               "epsilon": 0.001,
               "trainable": true,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "scale": false,
               "axis": -1,
               "gamma_constraint": null,
               "gamma_regularizer": null,
               "beta_regularizer": null,
               "momentum": 0.9997,
               "center": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_454",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "batch_normalization_454"
         },
         {
            "class_name": "Activation",
            "config": {
               "activation": "relu",
               "trainable": true,
               "name": "activation_454"
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_454",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "activation_454"
         },
         {
            "class_name": "Conv2D",
            "config": {
               "kernel_constraint": null,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "normal",
                     "scale": 2,
                     "seed": null,
                     "mode": "fan_in"
                  }
               },
               "name": "conv2d_455",
               "bias_regularizer": null,
               "bias_constraint": null,
               "activation": "linear",
               "trainable": true,
               "data_format": "channels_last",
               "padding": "valid",
               "strides": [
                  2,
                  2
               ],
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l2": 4.0E-5,
                     "l1": 0
                  }
               },
               "filters": 96,
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "use_bias": false,
               "activity_regularizer": null,
               "kernel_size": [
                  3,
                  3
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "activation_454",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "conv2d_455"
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "beta_constraint": null,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_455",
               "epsilon": 0.001,
               "trainable": true,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "scale": false,
               "axis": -1,
               "gamma_constraint": null,
               "gamma_regularizer": null,
               "beta_regularizer": null,
               "momentum": 0.9997,
               "center": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_455",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "batch_normalization_455"
         },
         {
            "class_name": "MaxPooling2D",
            "config": {
               "name": "max_pooling2d_14",
               "trainable": true,
               "data_format": "channels_last",
               "pool_size": [
                  3,
                  3
               ],
               "padding": "valid",
               "strides": [
                  2,
                  2
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "activation_454",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "max_pooling2d_14"
         },
         {
            "class_name": "Activation",
            "config": {
               "activation": "relu",
               "trainable": true,
               "name": "activation_455"
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_455",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "activation_455"
         },
         {
            "class_name": "Concatenate",
            "config": {
               "trainable": true,
               "name": "concatenate_1",
               "axis": -1
            },
            "inbound_nodes": [
               [
                  [
                     "max_pooling2d_14",
                     0,
                     0,
                     {}
                  ],
                  [
                     "activation_455",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "concatenate_1"
         },
         {
            "class_name": "Conv2D",
            "config": {
               "kernel_constraint": null,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "normal",
                     "scale": 2,
                     "seed": null,
                     "mode": "fan_in"
                  }
               },
               "name": "conv2d_458",
               "bias_regularizer": null,
               "bias_constraint": null,
               "activation": "linear",
               "trainable": true,
               "data_format": "channels_last",
               "padding": "same",
               "strides": [
                  1,
                  1
               ],
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l2": 4.0E-5,
                     "l1": 0
                  }
               },
               "filters": 64,
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "use_bias": false,
               "activity_regularizer": null,
               "kernel_size": [
                  1,
                  1
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "concatenate_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "conv2d_458"
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "beta_constraint": null,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_458",
               "epsilon": 0.001,
               "trainable": true,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "scale": false,
               "axis": -1,
               "gamma_constraint": null,
               "gamma_regularizer": null,
               "beta_regularizer": null,
               "momentum": 0.9997,
               "center": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_458",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "batch_normalization_458"
         },
         {
            "class_name": "Activation",
            "config": {
               "activation": "relu",
               "trainable": true,
               "name": "activation_458"
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_458",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "activation_458"
         },
         {
            "class_name": "Conv2D",
            "config": {
               "kernel_constraint": null,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "normal",
                     "scale": 2,
                     "seed": null,
                     "mode": "fan_in"
                  }
               },
               "name": "conv2d_459",
               "bias_regularizer": null,
               "bias_constraint": null,
               "activation": "linear",
               "trainable": true,
               "data_format": "channels_last",
               "padding": "same",
               "strides": [
                  1,
                  1
               ],
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l2": 4.0E-5,
                     "l1": 0
                  }
               },
               "filters": 64,
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "use_bias": false,
               "activity_regularizer": null,
               "kernel_size": [
                  1,
                  7
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "activation_458",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "conv2d_459"
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "beta_constraint": null,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_459",
               "epsilon": 0.001,
               "trainable": true,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "scale": false,
               "axis": -1,
               "gamma_constraint": null,
               "gamma_regularizer": null,
               "beta_regularizer": null,
               "momentum": 0.9997,
               "center": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_459",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "batch_normalization_459"
         },
         {
            "class_name": "Activation",
            "config": {
               "activation": "relu",
               "trainable": true,
               "name": "activation_459"
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_459",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "activation_459"
         },
         {
            "class_name": "Conv2D",
            "config": {
               "kernel_constraint": null,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "normal",
                     "scale": 2,
                     "seed": null,
                     "mode": "fan_in"
                  }
               },
               "name": "conv2d_456",
               "bias_regularizer": null,
               "bias_constraint": null,
               "activation": "linear",
               "trainable": true,
               "data_format": "channels_last",
               "padding": "same",
               "strides": [
                  1,
                  1
               ],
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l2": 4.0E-5,
                     "l1": 0
                  }
               },
               "filters": 64,
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "use_bias": false,
               "activity_regularizer": null,
               "kernel_size": [
                  1,
                  1
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "concatenate_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "conv2d_456"
         },
         {
            "class_name": "Conv2D",
            "config": {
               "kernel_constraint": null,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "normal",
                     "scale": 2,
                     "seed": null,
                     "mode": "fan_in"
                  }
               },
               "name": "conv2d_460",
               "bias_regularizer": null,
               "bias_constraint": null,
               "activation": "linear",
               "trainable": true,
               "data_format": "channels_last",
               "padding": "same",
               "strides": [
                  1,
                  1
               ],
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l2": 4.0E-5,
                     "l1": 0
                  }
               },
               "filters": 64,
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "use_bias": false,
               "activity_regularizer": null,
               "kernel_size": [
                  7,
                  1
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "activation_459",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "conv2d_460"
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "beta_constraint": null,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_456",
               "epsilon": 0.001,
               "trainable": true,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "scale": false,
               "axis": -1,
               "gamma_constraint": null,
               "gamma_regularizer": null,
               "beta_regularizer": null,
               "momentum": 0.9997,
               "center": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_456",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "batch_normalization_456"
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "beta_constraint": null,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_460",
               "epsilon": 0.001,
               "trainable": true,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "scale": false,
               "axis": -1,
               "gamma_constraint": null,
               "gamma_regularizer": null,
               "beta_regularizer": null,
               "momentum": 0.9997,
               "center": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_460",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "batch_normalization_460"
         },
         {
            "class_name": "Activation",
            "config": {
               "activation": "relu",
               "trainable": true,
               "name": "activation_456"
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_456",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "activation_456"
         },
         {
            "class_name": "Activation",
            "config": {
               "activation": "relu",
               "trainable": true,
               "name": "activation_460"
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_460",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "activation_460"
         },
         {
            "class_name": "Conv2D",
            "config": {
               "kernel_constraint": null,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "normal",
                     "scale": 2,
                     "seed": null,
                     "mode": "fan_in"
                  }
               },
               "name": "conv2d_457",
               "bias_regularizer": null,
               "bias_constraint": null,
               "activation": "linear",
               "trainable": true,
               "data_format": "channels_last",
               "padding": "valid",
               "strides": [
                  1,
                  1
               ],
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l2": 4.0E-5,
                     "l1": 0
                  }
               },
               "filters": 96,
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "use_bias": false,
               "activity_regularizer": null,
               "kernel_size": [
                  3,
                  3
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "activation_456",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "conv2d_457"
         },
         {
            "class_name": "Conv2D",
            "config": {
               "kernel_constraint": null,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "normal",
                     "scale": 2,
                     "seed": null,
                     "mode": "fan_in"
                  }
               },
               "name": "conv2d_461",
               "bias_regularizer": null,
               "bias_constraint": null,
               "activation": "linear",
               "trainable": true,
               "data_format": "channels_last",
               "padding": "valid",
               "strides": [
                  1,
                  1
               ],
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l2": 4.0E-5,
                     "l1": 0
                  }
               },
               "filters": 96,
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "use_bias": false,
               "activity_regularizer": null,
               "kernel_size": [
                  3,
                  3
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "activation_460",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "conv2d_461"
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "beta_constraint": null,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_457",
               "epsilon": 0.001,
               "trainable": true,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "scale": false,
               "axis": -1,
               "gamma_constraint": null,
               "gamma_regularizer": null,
               "beta_regularizer": null,
               "momentum": 0.9997,
               "center": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_457",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "batch_normalization_457"
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "beta_constraint": null,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_461",
               "epsilon": 0.001,
               "trainable": true,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "scale": false,
               "axis": -1,
               "gamma_constraint": null,
               "gamma_regularizer": null,
               "beta_regularizer": null,
               "momentum": 0.9997,
               "center": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_461",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "batch_normalization_461"
         },
         {
            "class_name": "Activation",
            "config": {
               "activation": "relu",
               "trainable": true,
               "name": "activation_457"
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_457",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "activation_457"
         },
         {
            "class_name": "Activation",
            "config": {
               "activation": "relu",
               "trainable": true,
               "name": "activation_461"
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_461",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "activation_461"
         },
         {
            "class_name": "Concatenate",
            "config": {
               "trainable": true,
               "name": "concatenate_2",
               "axis": -1
            },
            "inbound_nodes": [
               [
                  [
                     "activation_457",
                     0,
                     0,
                     {}
                  ],
                  [
                     "activation_461",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "concatenate_2"
         },
         {
            "class_name": "Conv2D",
            "config": {
               "kernel_constraint": null,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "normal",
                     "scale": 2,
                     "seed": null,
                     "mode": "fan_in"
                  }
               },
               "name": "conv2d_462",
               "bias_regularizer": null,
               "bias_constraint": null,
               "activation": "linear",
               "trainable": true,
               "data_format": "channels_last",
               "padding": "valid",
               "strides": [
                  2,
                  2
               ],
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l2": 4.0E-5,
                     "l1": 0
                  }
               },
               "filters": 192,
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "use_bias": false,
               "activity_regularizer": null,
               "kernel_size": [
                  3,
                  3
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "concatenate_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "conv2d_462"
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "beta_constraint": null,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_462",
               "epsilon": 0.001,
               "trainable": true,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "scale": false,
               "axis": -1,
               "gamma_constraint": null,
               "gamma_regularizer": null,
               "beta_regularizer": null,
               "momentum": 0.9997,
               "center": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_462",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "batch_normalization_462"
         },
         {
            "class_name": "Activation",
            "config": {
               "activation": "relu",
               "trainable": true,
               "name": "activation_462"
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_462",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "activation_462"
         },
         {
            "class_name": "MaxPooling2D",
            "config": {
               "name": "max_pooling2d_15",
               "trainable": true,
               "data_format": "channels_last",
               "pool_size": [
                  3,
                  3
               ],
               "padding": "valid",
               "strides": [
                  2,
                  2
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "concatenate_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "max_pooling2d_15"
         },
         {
            "class_name": "Concatenate",
            "config": {
               "trainable": true,
               "name": "concatenate_3",
               "axis": -1
            },
            "inbound_nodes": [
               [
                  [
                     "activation_462",
                     0,
                     0,
                     {}
                  ],
                  [
                     "max_pooling2d_15",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "concatenate_3"
         },
         {
            "class_name": "Conv2D",
            "config": {
               "kernel_constraint": null,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "normal",
                     "scale": 2,
                     "seed": null,
                     "mode": "fan_in"
                  }
               },
               "name": "conv2d_466",
               "bias_regularizer": null,
               "bias_constraint": null,
               "activation": "linear",
               "trainable": true,
               "data_format": "channels_last",
               "padding": "same",
               "strides": [
                  1,
                  1
               ],
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l2": 4.0E-5,
                     "l1": 0
                  }
               },
               "filters": 64,
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "use_bias": false,
               "activity_regularizer": null,
               "kernel_size": [
                  1,
                  1
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "concatenate_3",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "conv2d_466"
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "beta_constraint": null,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_466",
               "epsilon": 0.001,
               "trainable": true,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "scale": false,
               "axis": -1,
               "gamma_constraint": null,
               "gamma_regularizer": null,
               "beta_regularizer": null,
               "momentum": 0.9997,
               "center": true
            },
            "inbound_nodes": [
               [
                  [
                     "conv2d_466",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "batch_normalization_466"
         },
         {
            "class_name": "Activation",
            "config": {
               "activation": "relu",
               "trainable": true,
               "name": "activation_466"
            },
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_466",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "activation_466"
         },
         {
            "class_name": "Conv2D",
            "config": {
               "kernel_constraint": null,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "normal",
                     "scale": 2,
                     "seed": null,
                     "mode": "fan_in"
                  }
               },
               "name": "conv2d_464",
               "bias_regularizer": null,
               "bias_constraint": null,
               "activation": "linear",
               "trainable": true,
               "data_format": "channels_last",
               "padding": "same",
               "strides": [
                  1,
                  1
               ],
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l2": 4.0E-5,
                     "l1": 0
                  }
               },
               "filters": 64,
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "use_bias": false,
               "activity_regularizer": null,
               "kernel_size": [
                  1,
                  1
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "concatenate_3",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "conv2d_464"
         },
         {
            "class_name": "Conv2D",
            "config": {
               "kernel_constraint": null,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "distribution": "normal",
                     "scale": 2,
                     "seed": null,
                     "mode": "fan_in"
                  }
               },
               "name": "conv2d_467",
               "bias_regularizer": null,
               "bias_constraint": null,
               "activation": "linear",
               "trainable": true,
               "data_format": "channels_last",
               "padding": "same",
               "strides": [
                  1,
                  1
               ],
               "dilation_rate": [
                  1,
                  1
               ],
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l2": 4.0E-5,
                     "l1": 0
                  }
               },
               "filters": 96,
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "use_bias": false,
               "activity_regularizer": null,
               "kernel_size": [
                  3,
                  3
               ]
            },
            "inbound_nodes": [
               [
                  [
                     "activation_466",
                     0,
                     0,
                     {}
                  ]
               ]
            ],
            "name": "conv2d_467"
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "beta_constraint": null,
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "name": "batch_normalization_464",
               "epsilon": 0.001,
               "trainable": true,
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_initializer": {
                  "class_name": "Zeros",
